Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  FINAL MODEL HANDLE — Updated for rtc_i2c v2.0
 *  Fixes: time.minutes → time.min, twist/timer logic, warnings
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/* ============================================================
   EXTERNAL ADC + RTC
   ============================================================ */
extern ADC_Data adcData;
extern RTC_Time_t time;

/* ============================================================
   GLOBAL FLAGS (UNCHANGED)
   ============================================================ */
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/* ============================================================
   MOTOR STATUS (0 = OFF, 1 = ON)
   ============================================================ */
volatile uint8_t motorStatus = 0;

/* ============================================================
   SAFETY FLAGS
   ============================================================ */
volatile bool senseDryRun         = false;
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;

/* ============================================================
   MANUAL OVERRIDE FLAG
   ============================================================ */
volatile bool manualOverride = false;

/* ============================================================
   UTILITY HELPERS
   ============================================================ */
static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
}

/* ============================================================
   MOTOR CONTROL — ANTI-CHATTER
   ============================================================ */
static inline void motor_apply(bool on)
{
    if (on == Motor_GetStatus())
        return;

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

bool Motor_GetStatus(void)
{
    return (motorStatus);
}

/* ============================================================
   MANUAL CONTROL
   ============================================================ */
void ModelHandle_SetMotor(bool on)
{
    clear_all_modes();
    manualOverride = true;
    senseDryRun = true;

    if (on) start_motor();
    else    stop_motor();
}
void reset(void){
	if (Motor_GetStatus())  // If motor is ON
	  {
	    // Turn OFF motor for 2-3 seconds, then turn ON again
	    stop_motor();     // Turn OFF motor
	    HAL_Delay(2000);  // Wait for 2 seconds
	    start_motor();    // Turn ON motor
	  } else              // If motor is OFF
	  {
	    // Turn ON motor for 2-3 seconds, then turn OFF again
	    start_motor();    // Turn ON motor
	    HAL_Delay(2000);  // Wait for 2 seconds
	    stop_motor();     // Turn OFF motor
	  }
}
/* ============================================================
   TANK FULL DETECTION
   ============================================================ */
static inline bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;
    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if (now - stableStart >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

    return false;
}

/* ============================================================
   DRY RUN CHECK
   ============================================================ */
void ModelHandle_CheckDryRun(void)
{
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = true;
        return;
    }

    float v = adcData.voltages[0];
    senseDryRun = (v <= 0.01f);
}

/* ============================================================
   MANUAL MODE TOGGLE
   ============================================================ */
void ModelHandle_ToggleManual(void)
{
    if (manualActive)
    {
        manualActive = false;
        stop_motor();
    }
    else
    {
        clear_all_modes();
        manualActive = true;
        manualOverride = true;
        start_motor();
    }
}

/* ============================================================
   STOP EVERYTHING
   ============================================================ */
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
}

/* ============================================================
   DRY RUN SOFT PROBE HANDLER
   ============================================================ */

typedef enum {
    DRY_IDLE = 0,
    DRY_PROBE,
    DRY_NORMAL
} DryFSMState;

static DryFSMState dryState = DRY_IDLE;
static bool dryConfirming   = false;

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;

#define DRY_PROBE_ON_MS     5000UL
#define DRY_PROBE_OFF_MS   10000UL
#define DRY_CONFIRM_MS      1500UL

static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            timerActive ||
            autoActive);
}

