Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_SoftDryRunHandler(void)
{
    uint32_t now = now_ms();
    ModelHandle_CheckDryRun();

    /* No modes active → ignore */
    if (!isAnyModeActive())
    {
        stop_motor();
        dryState = DRY_IDLE;
        dryConfirming = false;
        return;
    }

    switch (dryState)
    {
        case DRY_IDLE:
            if (senseDryRun)   // Water
            {
                start_motor();
                dryState = DRY_NORMAL;
            }
            else               // Dry
            {
                if (now >= dryDeadline)
                {
                    start_motor();
                    dryState = DRY_PROBE;
                    dryDeadline = now + DRY_PROBE_ON_MS;
                }
            }
            break;

        case DRY_PROBE:
            if (senseDryRun)
            {
                dryState = DRY_NORMAL;
                break;
            }

            if (now >= dryDeadline)
            {
                stop_motor();
                dryState = DRY_IDLE;
                dryDeadline = now + DRY_PROBE_OFF_MS;
            }
            break;

        case DRY_NORMAL:
            if (!senseDryRun) // dry detected
            {
                if (!dryConfirming)
                {
                    dryConfirming = true;
                    dryConfirmStart = now;
                }
                else if (now - dryConfirmStart >= DRY_CONFIRM_MS)
                {
                    stop_motor();
                    dryState = DRY_IDLE;
                    dryConfirming = false;
                    dryDeadline = now + DRY_PROBE_OFF_MS;
                }
            }
            else
                dryConfirming = false;
            break;
    }
}

void ModelHandle_ProcessDryRun(void)
{
    ModelHandle_SoftDryRunHandler();
}
/***************************************************************
 *  ==================== COUNTDOWN MODE (FINAL) ====================
 ***************************************************************/

volatile uint32_t countdownDuration = 0;     // live remaining seconds
volatile uint32_t countdownSetMinutes = 1;   // user-set minutes
static uint32_t cd_deadline_ms = 0;

/* Stop Countdown */
void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownDuration = 0;
    stop_motor();
}

/* Start Countdown with LAST SET VALUE */
void ModelHandle_StartCountdown(uint32_t minutes)
{
    clear_all_modes();

    if (minutes == 0)
        minutes = 1;

    countdownActive = true;
    countdownSetMinutes = minutes;

    countdownDuration = minutes * 60;     // convert to seconds
    cd_deadline_ms = now_ms() + (countdownDuration * 1000UL);

    start_motor();
}

/* Called when user LONG-PRESS DOWN BUTTON */
void ModelHandle_IncrementCountdown_LongPress(void)
{
    countdownSetMinutes++;   // Increase minutes
    if (countdownSetMinutes > 999)
        countdownSetMinutes = 999;

    // Update duration and restart engine
    countdownDuration = countdownSetMinutes * 60;
    cd_deadline_ms = now_ms() + (countdownDuration * 1000UL);
}

/* Countdown Engine - Call inside main loop */
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    // SAFETY EXIT CONDITIONS
    if (isTankFull() ||
        senseOverLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        ModelHandle_StopCountdown();
        return;
    }

    // TIME COMPLETED
    if (now >= cd_deadline_ms)
    {
        ModelHandle_StopCountdown();
        return;
    }

    // LIVE TIME LEFT
    countdownDuration = (cd_deadline_ms - now) / 1000UL;

    // enforce motor ON
    start_motor();
}

/***************************************************************
 *  ======================== TWIST MODE ========================
 ***************************************************************/

TwistSettings twistSettings;

static bool     twist_on_phase = false;
static uint32_t twist_deadline = 0;

void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();

    if (on_s == 0)  on_s = 1;
    if (off_s == 0) off_s = 1;

    twistSettings.onDurationSeconds  = on_s;
    twistSettings.offDurationSeconds = off_s;

    twistSettings.onHour   = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour  = offH;
    twistSettings.offMinute= offM;

    twistSettings.twistArmed = true;
    twistActive = false;

    twist_on_phase = true;
    twist_deadline = now_ms() + (on_s * 1000UL);

    start_motor();
}

void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
}

/* TIME-BASED ON/OFF START/STOP */
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed)
        return;

    /* Start twist */
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;

        twist_on_phase = true;
        twist_deadline = now_ms() + twistSettings.onDurationSeconds * 1000UL;

        start_motor();
    }

    /* Stop twist */
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}

/* PHASE-BASED DURATION HANDLER */
static void twist_tick(void)
{
    if (!twistActive) return;

    uint32_t now = now_ms();

    if (isTankFull())
    {
        ModelHandle_StopTwist();
        return;
    }

    if (now >= twist_deadline)
    {
        if (twist_on_phase)
        {
            twist_on_phase = false;
            stop_motor();
            twist_deadline = now + twistSettings.offDurationSeconds * 1000UL;
        }
        else
        {
            twist_on_phase = true;
            start_motor();
            twist_deadline = now + twistSettings.onDurationSeconds * 1000UL;
        }
    }

    /* safety: enforce relay state */
    if (twist_on_phase) start_motor();
    else                stop_motor();
}
/***************************************************************
 *  ========================= TIMER MODE ========================
 ***************************************************************/

