Amiya200/stm32_water_tank/Core/Src/model_handle.c
TimerSlot timerSlots[5];

/* Check if ANY timer slot is active right now */
static bool timer_any_slot_should_run(void)
{
    RTC_GetTimeDate();

    uint32_t nowS = (time.hour * 3600UL) + (time.min * 60UL);
    uint8_t todayBit = 1 << (time.dow - 1); // dow: 1=Mon ... 7=Sun

    for (int i = 0; i < 5; i++)
    {
        if (!timerSlots[i].enabled)
            continue;

        // Check day
        if (!(timerSlots[i].dayMask & todayBit))
            continue;

        uint32_t onS  = timerSlots[i].onHour  * 3600UL +
                        timerSlots[i].onMinute * 60UL;

        uint32_t offS = timerSlots[i].offHour * 3600UL +
                        timerSlots[i].offMinute * 60UL;

        // Normal window
        if (onS < offS)
        {
            if (nowS >= onS && nowS < offS)
                return true;
        }
        // Overnight window (crosses midnight)
        else
        {
            if (nowS >= onS || nowS < offS)
                return true;
        }
    }

    return false;
}

/* Re-run timer check after modifying slots */
void ModelHandle_TimerRecalculateNow(void)
{
    if (!timerActive)
        return;

    if (timer_any_slot_should_run())
        start_motor();
    else
        stop_motor();
}

/* Start Timer Mode */
void ModelHandle_StartTimer(void)
{
    clear_all_modes();
    timerActive = true;

    if (timer_any_slot_should_run())
        start_motor();
    else
        stop_motor();
}

/* Stop Timer Mode */
void ModelHandle_StopTimer(void)
{
    timerActive = false;
    stop_motor();
}

/* TIMER ENGINE */
static void timer_tick(void)
{
    if (!timerActive)
        return;

    // Tank full → immediate stop
    if (isTankFull())
    {
        stop_motor();
        return;
    }

    if (timer_any_slot_should_run())
        start_motor();
    else
        stop_motor();
}



/***************************************************************
 *  MODEL_HANDLE.C — PART 3 OF 4
 *  Semi-Auto + Auto mode + Protections + LED System
 ***************************************************************/

/* ============================================================
   SEMI-AUTO MODE
   ============================================================ */
void ModelHandle_StartSemiAuto(void)
{
    clear_all_modes();
    semiAutoActive = true;

    if (!isTankFull())
        start_motor();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
}
/***************************************************************
 *  ======================== AUTO MODE (PROBE FIRST) ========================
 *  Motor ON → probe duration → check dry → decide
 ***************************************************************/

static uint16_t auto_gap_s       = 60;
static uint16_t auto_maxrun_min  = 12;
static uint16_t auto_retry_limit = 5;
static uint8_t  auto_retry_count = 0;

/* PROBE duration for water detect */
#define AUTO_PROBE_MS 5000   // 5 sec ON before checking dry

typedef enum {
    AUTO_IDLE = 0,
    AUTO_PROBE_ON,    // motor ON for probe duration
    AUTO_RUN,         // water OK → continue normal auto
    AUTO_DRY_WAIT,    // no water → wait then retry
    AUTO_GAP_WAIT     // normal cycle gap
} AutoState;

static AutoState autoState = AUTO_IDLE;
static uint32_t autoDeadline = 0;
static uint32_t autoRunStart = 0;

void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry)
{
    clear_all_modes();
    autoActive = true;

    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;

    /* Start in probe state */
    autoState = AUTO_PROBE_ON;
    start_motor();

    autoRunStart = now_ms();
    autoDeadline = now_ms() + AUTO_PROBE_MS;   // probe for 5s
}

void ModelHandle_StopAuto(void)
{
    autoActive = false;
    auto_retry_count = 0;
    autoState = AUTO_IDLE;
    stop_motor();
}

static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = now_ms();

    /* ============================
       Global Protection Check
       ============================ */
    if (isTankFull() ||
        senseOverLoad ||
        senseOverUnderVolt)
    {
        stop_motor();
        autoState = AUTO_GAP_WAIT;
        autoDeadline = now + auto_gap_s * 1000UL;
        return;
    }

    switch (autoState)
    {
    /* ====================================================
       FIRST PHASE: MOTOR MUST TURN ON BEFORE DRY CHECK
       ==================================================== */
    case AUTO_PROBE_ON:
        if (now >= autoDeadline)
        {
            /* After probe time → NOW check dry */
            if (!senseDryRun)   // NO WATER
            {
                stop_motor();
                auto_retry_count++;

                if (auto_retry_count >= auto_retry_limit)
                {
                    autoState = AUTO_IDLE;   // stop permanently
                    return;
                }

                autoState = AUTO_DRY_WAIT;
                autoDeadline = now + auto_gap_s * 1000UL;
                return;
            }

            /* Water present → go to RUN mode */
            autoRunStart = now;
            autoState = AUTO_RUN;
        }
        break;

    /* ====================================================
       NORMAL RUNNING MODE (water present)
       ==================================================== */
    case AUTO_RUN:
    {
        uint32_t elapsed_min = (now - autoRunStart) / 60000UL;

        /* Max Run reached → off + gap */
        if (elapsed_min >= auto_maxrun_min)
        {
            stop_motor();
            autoState = AUTO_GAP_WAIT;
            autoDeadline = now + auto_gap_s * 1000UL;
            return;
        }

        /* Dry detected during running */
        if (!senseDryRun)
        {
            stop_motor();
            auto_retry_count++;

            if (auto_retry_count >= auto_retry_limit)
            {
                autoState = AUTO_IDLE;
                return;
            }

            autoState = AUTO_DRY_WAIT;
            autoDeadline = now + auto_gap_s * 1000UL;
            return;
        }

        /* Motor MUST remain ON */
        start_motor();
    }
    break;

    /* ====================================================
       DRY → Wait GAP → retry
       ==================================================== */
    case AUTO_DRY_WAIT:
        if (now >= autoDeadline)
        {
            start_motor();
            autoState = AUTO_PROBE_ON; // next cycle again probes
            autoDeadline = now + AUTO_PROBE_MS;
        }
        break;

    /* ====================================================
       NORMAL GAP → restart next cycle
       ==================================================== */
    case AUTO_GAP_WAIT:
        if (now >= autoDeadline)
        {
            start_motor();
            autoState = AUTO_PROBE_ON;  // first probe each cycle
            autoDeadline = now + AUTO_PROBE_MS;
        }
        break;

    case AUTO_IDLE:
    default:
        stop_motor();
        break;
    }
}

/***************************************************************
 *  ======================== PROTECTIONS ========================
 ***************************************************************/

