Amiya200/stm32_water_tank/Core/Src/model_handle.c
static void protections_tick(void)
{
    if (senseOverLoad || senseOverUnderVolt)
    {
        ModelHandle_StopAllModesAndMotor();
        return;
    }
}

/***************************************************************
 *  ======================== LED SYSTEM =========================
 ***************************************************************/

static void leds_from_model(void)
{
    LED_ClearAllIntents();

    /* MOTOR ON → GREEN solid */
    if (Motor_GetStatus())
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);

    /* DRY-RUN retry → GREEN blink */
    if (!senseDryRun && autoActive)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);

    /* Motor stopped due to dry-run → RED solid */
    if (!senseDryRun && !Motor_GetStatus())
        LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);

    /* Max-run reached → RED blink */
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);

    /* Overload → BLUE blink */
    if (senseOverLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);

    /* Voltage faults → PURPLE blink */
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);

    LED_ApplyIntents();
}
/***************************************************************
 *  MODEL_HANDLE.C — PART 4 OF 4
 *  Main Process Loop + Reset + EEPROM Save
 ***************************************************************/

/* ============================================================
   MAIN PROCESS LOOP — MASTER FSM
   ============================================================ */
/***************************************************************
 *  MAIN MODE PROCESSOR (FINAL)
 ***************************************************************/
void ModelHandle_Process(void)
{
    /* ========== GLOBAL PROTECTION CHECKS ========== */

    if (senseOverLoad || senseOverUnderVolt || senseMaxRunReached)
    {
        // Hard shutdown of everything
        stop_motor();
        return;
    }

    /* ========== MODE PRIORITY ENGINE ========== */

    // 1. MANUAL MODE (top priority)
    if (manualActive)
    {
        // Manual ignores dry run, but NOT heavy protections
        if (!senseOverLoad && !senseOverUnderVolt && !senseMaxRunReached)
        {
            if (manualOverride)
                start_motor();
        }
        return;
    }

    // 2. SEMI-AUTO
    if (semiAutoActive)
    {
        if (isTankFull())
        {
            stop_motor();
        }
        else
        {
            start_motor();
        }
        return;
    }

    // 3. COUNTDOWN MODE
    if (countdownActive)
    {
        countdown_tick();   // <<<< NECESSARY
        return;
    }

    // 4. TWIST MODE
    if (twistActive || twistSettings.twistArmed)
    {
        twist_time_logic();
        twist_tick();
        return;
    }

    // 5. TIMER MODE
    if (timerActive)
    {
        timer_tick();
        return;
    }

    // 6. AUTO MODE (default automation)
    if (autoActive)
    {
        auto_tick();
        return;
    }

    /* If no mode active → ensure motor stays off */
    stop_motor();
}

/* ============================================================
   RESET ALL STATES
   ============================================================ */
void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();

    senseDryRun         = false;
    senseOverLoad       = false;
    senseOverUnderVolt  = false;
    senseMaxRunReached  = false;

    countdownDuration = 0;

    UART_SendStatusPacket();
}

/* ============================================================
   AUTO SETTINGS UPDATE
   ============================================================ */
void ModelHandle_SetAutoSettings(uint16_t gap_s,
                                 uint16_t maxrun_min,
                                 uint8_t retry_count)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry_count;
    auto_retry_count = 0;
}

bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}

/* ============================================================
   SAVE STATE TO EEPROM
   ============================================================ */
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    /* Encode current mode */
    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;
    else                      s.mode = 0;

    /* Additional fields (expandable) */
    // s.countdownMin  = countdownDuration / 60;
    // s.twistOn       = twistSettings.onDurationSeconds;
    // s.twistOff      = twistSettings.offDurationSeconds;

    RTC_SavePersistentState(&s);
}
